
# -*- coding: utf-8 -*

# 1. ========== 函数 ========== 
def x():
    a = abs(-100)
    b = abs(-1)
    return a, b

a_val, b_val = x()
r = x()

print(a_val, b_val) # (100, 1)
print(r) # (100, 1)
print(r[0]) # 100



# 2. ========== 函数参数========== 
def y(L = []):
    L.append(1)
    print L
y() # [1]
y() # [1, 1]
y() # [1, 1, 1]

# ???? 因为默认参数L也是一个变量, 它指向对象[], 每次调用该函数，如果改变了L的内容，则下次调用时，默认参数的内容就变了，不再是函数定义时的[]了
# 所以，定义默认参数要牢记一点：默认参数必须指向不变对象！

def y1(L = None):
    if L is None:
        L = []
    L.append(1)
    print L
y1() # [1]
y1() # [1]


# 3. ========== 可变参数 ========== 
def y2(*nums):
    print(nums)

y2()
y2([1, 2, 3])
y2(1, 3, 5, 7)