# -*- coding: utf-8 -*

# 1. get data from list or tuple
List = [1, 2, 3, 4, 5, 6]
# 从索引0开始取，直到索引3为止，但不包括索引3, 就是索引0,1,2
# 结果 [1, 2, 3]
print(List[0:3])
# 索引 1,2,3,4 结果: [2, 3, 4, 5]
print(List[1:5])

# 2. 倒数获取数据
print('取最后一个值', List[-1])
# List[-2:] 从-2位置开始, -2-(0) = 2个元素 结果: [5, 6]
print('取区间', List[-2:])
# List[-2:] 从-2位置开始, -2-(-1) = 1个元素 结果: [5]
print('取区间', List[-2:-1])


# 3. 其他
# 创建1-100的tuple
L = range(1, 101)
print(L)
print(L[-10:])
# 从索引1开始, 到索引8, 每两个取一个 结论: [2, 4, 6, 8]
print(L[1:9:2])
# 所有数据, 每10个取一个 结论: [1, 11, 21, 31, 41, 51, 61, 71, 81, 91]
print(L[::10])
